cases/chpt4-bis-LfOn/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// This is for gallium in cavity

//phaseChange 1.0;
alpha1TControl 1.0;
alphaInterfaceCut 1e6;

//phases (Phase1 Phase2);

phases (Phase1 Phase2 Phase3);

phaseChangeTwoPhaseMixture Weld;

pSat            0;   // Saturation pressure
pMin            0; 

sigma           0;//.05;//.01;//.3;//0.07;
sigma12         0.0378;//370e-3;
sigma13         0.0378;//0.037;//0.037;//0;//370e-3;
sigma23         0;//-0.037;//0.037;//370e-3; ZERO!
D23             0;

k [1 1 -3 -1 0 0 0] 1;
nuEM 1;
nu [0 2 -1 0 0 0 0] 2.98e-07;
rho [1 -3 0 0 0 0 0] 6000;
cp [0 2 -2 -1 0 0 0] 381.5;

k_weld 0;//40; 

multiplierBuoy 8e8;
multiplierBuoyG 0;//1.6e6;
sourceTime 0;

dmdtRelaxAlpha 10;//2.5;
dmdtRelaxPressure 0;//-0.25;//-0.005;//.03;//25;//-0.005;

SuFudge 0;
testFudge 1;

dsigmadT -4.03e-5;//.1;

meltingT 544.55;

T_0 544.55;

//cp cp [0 2 -2 -1 0 0 0] 381.5;

rhoRef 9780;

Lf  44600; //80.16 kJ/kg

Tref 544.55;

LfLimit true;
vsfRho false;//true;
LfSmoothing false;//true;
alphaGeo false;

beta 0;
//beta_2 210e-6;
//Tref_2 540.55;

Phase1 // air
{
    transportModel  Newtonian;
    nu              1.38e-05;
    rho             1.6337;
    cp              520;
    k               0.017;
}

Phase2 // liquid
{
    transportModel  Newtonian;
    nu              1.636e-07;
    rho             9780; //6093;
    Tref            544.55;
    beta            0;//1.34e-05;
    cp              123; //.5;
    k               10.35;
}

Phase3 // solid
{
    transportModel  Newtonian;
    nu              1.636e-07;
    rho             9780; 
    cp              123;
    k               10.35;
}


// ************************************************************************* //
